# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Floor..::..Create Method
Floor Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), ElementId, ElementId) | Creates a new instance of architectural floor within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), ElementId, ElementId, Boolean, Line, Double) | Creates a new instance of floor within the project. |

# See Also
Floor Class
Floor Members
Autodesk.Revit.DB Namespace